-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2022-08-16 09:36:08
-- 伺服器版本： 10.4.24-MariaDB
-- PHP 版本： 8.1.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `db24_3`
--

-- --------------------------------------------------------

--
-- 資料表結構 `movie`
--

CREATE TABLE `movie` (
  `id` int(11) UNSIGNED NOT NULL,
  `name` varchar(64) COLLATE utf8mb4_unicode_ci NOT NULL,
  `level` varchar(10) COLLATE utf8mb4_unicode_ci NOT NULL,
  `length` int(11) UNSIGNED NOT NULL,
  `ondate` date NOT NULL,
  `publish` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `director` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `trailer` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `poster` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `intro` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `rank` int(11) UNSIGNED NOT NULL,
  `sh` int(1) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `movie`
--

INSERT INTO `movie` (`id`, `name`, `level`, `length`, `ondate`, `publish`, `director`, `trailer`, `poster`, `intro`, `rank`, `sh`) VALUES
(4, '888', '輔導級', 888, '2022-08-10', '888', '888', '03B01v.mp4', '03B01.png', '888', 1, 1),
(5, '泰山職訓生死鬥', '限制級', 965, '2022-08-15', '泰山職訓場', '泰山職訓場', '03B04v.mp4', '03B07.png', '泰山職訓生死鬥泰山職訓生死鬥泰山職訓生死鬥泰山職訓生死鬥泰山職訓生死鬥泰山職訓生死鬥泰山職訓生死鬥泰山職訓生死鬥泰山職訓生死鬥泰山職訓生死鬥', 5, 1),
(9, '預告片3', '保護級', 30, '2022-08-15', '宜蘭職訓場', '宜蘭訓練場', '03B25v.mp4', '03B25.png', 'ㄎㄎㄎㄎㄎㄎㄎㄎ', 6, 1),
(10, '預告片4', '普遍級', 120, '1900-01-15', '泰山職訓場', '泰山職訓場', '03B25v.mp4', '03B07.png', '112121111111', 10, 1);

-- --------------------------------------------------------

--
-- 資料表結構 `orders`
--

CREATE TABLE `orders` (
  `id` int(11) NOT NULL,
  `no` varchar(12) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '訂單編號',
  `movie` varchar(12) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '電影名稱',
  `date` date NOT NULL COMMENT '日期',
  `session` text COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '場次',
  `qt` int(11) NOT NULL COMMENT '數量',
  `seats` text COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '位置'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `orders`
--

INSERT INTO `orders` (`id`, `no`, `movie`, `date`, `session`, `qt`, `seats`) VALUES
(3, '202208120003', '院線片03', '2022-08-14', '18:00~20:00', 3, 'a:3:{i:0;i:1;i:1;i:10;i:2;i:5;}'),
(4, '202208120004', '院線片03', '2022-08-14', '16:00~18:00', 4, 'a:4:{i:0;i:9;i:1;i:10;i:2;i:14;i:3;i:16;}'),
(5, '202208120005', '院線片03', '2022-08-15', '14:00~16:00', 4, 'a:4:{i:0;i:19;i:1;i:5;i:2;i:16;i:3;i:12;}'),
(7, '202208120007', '院線片02', '2022-08-13', '22:00~24:00', 1, 'a:1:{i:0;i:19;}'),
(8, '202208120008', '院線片03', '2022-08-15', '18:00~20:00', 4, 'a:4:{i:0;i:5;i:1;i:13;i:2;i:6;i:3;i:9;}'),
(9, '202208120009', '院線片01', '2022-08-13', '16:00~18:00', 3, 'a:3:{i:0;i:6;i:1;i:11;i:2;i:18;}'),
(10, '202208120010', '院線片02', '2022-08-15', '16:00~18:00', 4, 'a:4:{i:0;i:15;i:1;i:1;i:2;i:2;i:3;i:19;}'),
(14, '202208120014', '院線片02', '2022-08-15', '22:00~24:00', 4, 'a:4:{i:0;i:1;i:1;i:6;i:2;i:15;i:3;i:4;}'),
(15, '202208120015', '院線片01', '2022-08-14', '14:00~16:00', 4, 'a:4:{i:0;i:2;i:1;i:14;i:2;i:9;i:3;i:4;}'),
(19, '202208120019', '院線片01', '2022-08-14', '18:00~20:00', 2, 'a:2:{i:0;i:4;i:1;i:3;}'),
(20, '202208120020', '院線片03', '2022-08-13', '18:00~20:00', 1, 'a:1:{i:0;i:4;}'),
(21, '202208120021', '院線片02', '2022-08-15', '16:00~18:00', 3, 'a:3:{i:0;i:14;i:1;i:7;i:2;i:17;}'),
(25, '202208120025', '院線片02', '2022-08-15', '22:00~24:00', 2, 'a:2:{i:0;i:5;i:1;i:10;}'),
(26, '202208120026', '院線片01', '2022-08-15', '16:00~18:00', 1, 'a:1:{i:0;i:11;}'),
(27, '202208120027', '院線片02', '2022-08-14', '16:00~18:00', 3, 'a:3:{i:0;i:10;i:1;i:3;i:2;i:16;}'),
(28, '202208120028', '院線片01', '2022-08-14', '20:00~22:00', 2, 'a:2:{i:0;i:7;i:1;i:4;}'),
(29, '202208120029', '院線片01', '2022-08-14', '16:00~18:00', 2, 'a:2:{i:0;i:7;i:1;i:13;}'),
(31, '202208120031', '院線片03', '2022-08-14', '14:00~16:00', 2, 'a:2:{i:0;i:8;i:1;i:6;}'),
(33, '202208120033', '院線片03', '2022-08-14', '16:00~18:00', 3, 'a:3:{i:0;i:14;i:1;i:3;i:2;i:15;}'),
(34, '202208120034', '院線片01', '2022-08-14', '20:00~22:00', 4, 'a:4:{i:0;i:10;i:1;i:7;i:2;i:3;i:3;i:2;}'),
(35, '202208120035', '院線片02', '2022-08-13', '14:00~16:00', 2, 'a:2:{i:0;i:10;i:1;i:13;}'),
(36, '202208120036', '院線片03', '2022-08-14', '16:00~18:00', 1, 'a:1:{i:0;i:3;}'),
(37, '202208120037', '院線片02', '2022-08-15', '18:00~20:00', 2, 'a:2:{i:0;i:0;i:1;i:13;}'),
(40, '202208120040', '院線片02', '2022-08-14', '16:00~18:00', 1, 'a:1:{i:0;i:3;}'),
(44, '202208120044', '院線片03', '2022-08-13', '16:00~18:00', 4, 'a:4:{i:0;i:9;i:1;i:6;i:2;i:3;i:3;i:19;}'),
(45, '202208120045', '院線片02', '2022-08-14', '22:00~24:00', 3, 'a:3:{i:0;i:2;i:1;i:17;i:2;i:19;}'),
(46, '202208120046', '院線片03', '2022-08-14', '14:00~16:00', 3, 'a:3:{i:0;i:12;i:1;i:11;i:2;i:9;}'),
(47, '202208120047', '院線片01', '2022-08-15', '16:00~18:00', 3, 'a:3:{i:0;i:10;i:1;i:17;i:2;i:19;}'),
(49, '202208120049', '院線片03', '2022-08-14', '20:00~22:00', 3, 'a:3:{i:0;i:5;i:1;i:10;i:2;i:15;}'),
(51, '202208120051', '院線片03', '2022-08-14', '14:00~16:00', 4, 'a:4:{i:0;i:7;i:1;i:10;i:2;i:12;i:3;i:0;}'),
(53, '202208120053', '院線片02', '2022-08-13', '14:00~16:00', 4, 'a:4:{i:0;i:19;i:1;i:0;i:2;i:4;i:3;i:2;}'),
(54, '202208120054', '院線片01', '2022-08-14', '22:00~24:00', 3, 'a:3:{i:0;i:5;i:1;i:8;i:2;i:12;}'),
(55, '202208120055', '院線片03', '2022-08-15', '14:00~16:00', 1, 'a:1:{i:0;i:15;}'),
(56, '202208120056', '院線片03', '2022-08-15', '22:00~24:00', 3, 'a:3:{i:0;i:9;i:1;i:7;i:2;i:1;}'),
(57, '202208120057', '院線片01', '2022-08-15', '14:00~16:00', 2, 'a:2:{i:0;i:1;i:1;i:15;}'),
(58, '202208120058', '院線片01', '2022-08-15', '18:00~20:00', 3, 'a:3:{i:0;i:13;i:1;i:6;i:2;i:17;}'),
(60, '202208120060', '院線片02', '2022-08-14', '14:00~16:00', 2, 'a:2:{i:0;i:9;i:1;i:5;}'),
(62, '202208120062', '院線片03', '2022-08-15', '20:00~22:00', 2, 'a:2:{i:0;i:9;i:1;i:19;}'),
(66, '202208120066', '院線片01', '2022-08-14', '14:00~16:00', 1, 'a:1:{i:0;i:18;}'),
(68, '202208120068', '院線片03', '2022-08-14', '18:00~20:00', 2, 'a:2:{i:0;i:3;i:1;i:10;}'),
(69, '202208120069', '院線片03', '2022-08-15', '22:00~24:00', 3, 'a:3:{i:0;i:9;i:1;i:18;i:2;i:5;}'),
(72, '202208120072', '院線片02', '2022-08-14', '18:00~20:00', 3, 'a:3:{i:0;i:14;i:1;i:4;i:2;i:3;}'),
(73, '202208120073', '院線片02', '2022-08-14', '22:00~24:00', 3, 'a:3:{i:0;i:11;i:1;i:5;i:2;i:9;}'),
(74, '202208120074', '院線片01', '2022-08-13', '16:00~18:00', 3, 'a:3:{i:0;i:9;i:1;i:6;i:2;i:16;}'),
(76, '202208120076', '院線片03', '2022-08-13', '18:00~20:00', 3, 'a:3:{i:0;i:2;i:1;i:16;i:2;i:12;}'),
(77, '202208120077', '院線片01', '2022-08-14', '16:00~18:00', 2, 'a:2:{i:0;i:16;i:1;i:5;}'),
(78, '202208120078', '院線片01', '2022-08-14', '14:00~16:00', 3, 'a:3:{i:0;i:17;i:1;i:3;i:2;i:0;}'),
(79, '202208120079', '院線片01', '2022-08-13', '16:00~18:00', 4, 'a:4:{i:0;i:11;i:1;i:19;i:2;i:5;i:3;i:16;}'),
(81, '202208120081', '院線片02', '2022-08-13', '20:00~22:00', 1, 'a:1:{i:0;i:10;}'),
(83, '202208120083', '院線片02', '2022-08-14', '22:00~24:00', 3, 'a:3:{i:0;i:11;i:1;i:7;i:2;i:8;}'),
(84, '202208120084', '院線片02', '2022-08-14', '20:00~22:00', 4, 'a:4:{i:0;i:13;i:1;i:7;i:2;i:9;i:3;i:17;}'),
(85, '202208120085', '院線片02', '2022-08-13', '14:00~16:00', 3, 'a:3:{i:0;i:16;i:1;i:17;i:2;i:0;}'),
(86, '202208120086', '院線片03', '2022-08-14', '22:00~24:00', 2, 'a:2:{i:0;i:15;i:1;i:7;}'),
(88, '202208120088', '院線片03', '2022-08-13', '18:00~20:00', 4, 'a:4:{i:0;i:5;i:1;i:14;i:2;i:15;i:3;i:8;}'),
(89, '202208120089', '院線片02', '2022-08-13', '14:00~16:00', 4, 'a:4:{i:0;i:4;i:1;i:15;i:2;i:17;i:3;i:3;}'),
(91, '202208120091', '院線片02', '2022-08-13', '18:00~20:00', 3, 'a:3:{i:0;i:1;i:1;i:9;i:2;i:0;}'),
(93, '202208120093', '院線片01', '2022-08-14', '14:00~16:00', 2, 'a:2:{i:0;i:5;i:1;i:4;}'),
(94, '202208120094', '院線片02', '2022-08-15', '14:00~16:00', 2, 'a:2:{i:0;i:19;i:1;i:18;}'),
(95, '202208120095', '院線片02', '2022-08-15', '20:00~22:00', 4, 'a:4:{i:0;i:10;i:1;i:6;i:2;i:19;i:3;i:2;}'),
(96, '202208120096', '院線片01', '2022-08-13', '16:00~18:00', 3, 'a:3:{i:0;i:2;i:1;i:15;i:2;i:19;}'),
(97, '202208120097', '院線片02', '2022-08-13', '18:00~20:00', 4, 'a:4:{i:0;i:7;i:1;i:0;i:2;i:3;i:3;i:5;}'),
(98, '202208120098', '院線片03', '2022-08-13', '20:00~22:00', 1, 'a:1:{i:0;i:4;}'),
(100, '202208120100', '院線片01', '2022-08-14', '18:00~20:00', 1, 'a:1:{i:0;i:5;}');

-- --------------------------------------------------------

--
-- 資料表結構 `poster`
--

CREATE TABLE `poster` (
  `id` int(11) UNSIGNED NOT NULL,
  `img` varchar(128) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(32) COLLATE utf8mb4_unicode_ci NOT NULL,
  `rank` int(11) UNSIGNED NOT NULL,
  `sh` int(1) UNSIGNED NOT NULL,
  `ani` int(1) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `poster`
--

INSERT INTO `poster` (`id`, `img`, `name`, `rank`, `sh`, `ani`) VALUES
(1, '03A01.jpg', '蠟筆小新', 2, 1, 3),
(2, '03A02.jpg', '預告片2', 3, 1, 2),
(3, '03A03.jpg', '預告片3', 1, 1, 3),
(4, '03A04.jpg', '預告片4', 4, 1, 3),
(5, '03A05.jpg', '預告片5', 5, 1, 2),
(6, '03A06.jpg', '預告片6', 6, 1, 2),
(7, '03A07.jpg', '預告片7', 7, 1, 1),
(8, '03A08.jpg', '預告片8', 8, 1, 3),
(9, '03A09.jpg', '預告片9', 9, 1, 1);

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `movie`
--
ALTER TABLE `movie`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `poster`
--
ALTER TABLE `poster`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `movie`
--
ALTER TABLE `movie`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `orders`
--
ALTER TABLE `orders`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=101;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `poster`
--
ALTER TABLE `poster`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
